export const weatherConditionsText = {
  clear: "Ясно",
  fewclouds: "Облачно с прояснениями",
  cloudy: "Пасмурно",
  rain: "Дождь",
  storm: "Гроза",
  snow: "Снег",
};

export const WMOCodes = {
  clear: [0, 1, 2],
  fewclouds: [3],
  cloudy: [
    4, 5, 6, 7, 8, 9, 11, 12, 18, 19, 28, 30, 31, 32, 33, 34, 35, 40, 41, 42,
    43, 44, 45, 46, 47, 48, 49, 76,
  ],
  rain: [
    14, 15, 16, 20, 21, 25, 50, 51, 52, 53, 54, 55, 58, 59, 60, 61, 62, 63, 64,
    65, 80, 81, 82, 91, 92,
  ],
  storm: [13, 17, 29, 95, 96, 97, 98, 99],
  snow: [
    22, 23, 24, 26, 27, 36, 37, 38, 39, 56, 57, 66, 67, 68, 69, 70, 71, 72, 73,
    74, 75, 77, 78, 79, 83, 84, 85, 86, 87, 88, 89, 90, 93, 94,
  ],
};
